let people = {
  number:0,
  name: "晴天",
  status:0,
  point: 0,
  sun: 0,
  water: 0,
  fertilizer:0
};

let originalData = {
  pai:[
    {
      number:1,
      name: "晴天",
      status:0,
      point: [0,0,0,0],
      cost: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      output: [[1,0,0],[2,0,0],[1,1,0],[2,1,0]],
      upGrade1:[[1,0,0],undefined,[1,1,0],undefined],
      upGrade2:[[1,0,0],[1,1,0],undefined,undefined],
      add12:[1,0,0],
      add13:[1,0,0],
      add24:[1,1,0],
      add34:[1,1,0],
      details:[
        "免费生产(太阳+1)，升级1(太阳-1)     升级后(太阳+2)，升级2(太阳-2)升级后(太阳+1 水+1)",
        "免费生产(太阳+2)，升级2(太阳-1 水-1)升级后(太阳+2 水+1)",
        "免费生产(太阳+1 水+1)，升级1(太阳-1 水-1)升级后(太阳+2 水+1)",
        "免费生产(太阳+2 水+1)已是最高等级"
      ]

    },
    {
      number:2,
      name: "晴天",
      status:0,
      point: [0,0,0,0],
      cost: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      output: [[1,0,0],[2,0,0],[1,1,0],[2,1,0]],
      upGrade1:[[1,0,0],undefined,[1,1,0],undefined],
      upGrade2:[[1,0,0],[1,1,0],undefined,undefined],
      add12:[1,0,0],
      add13:[1,0,0],
      add24:[1,1,0],
      add34:[1,1,0],
      details:[
        "免费生产(太阳+1)，升级1(太阳-1)     升级后(太阳+2)，升级2(太阳-2)升级后(太阳+1 水+1)",
        "免费生产(太阳+2)，升级2(太阳-1 水-1)升级后(太阳+2 水+1)",
        "免费生产(太阳+1 水+1)，升级1(太阳-1 水-1)升级后(太阳+2 水+1)",
        "免费生产(太阳+2 水+1)已是最高等级"
      ]

    },
    {
      number:3,
      name: "晴天",
      status:0,
      point: [0,0,0,0],
      cost: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      output: [[1,0,0],[2,0,0],[1,1,0],[2,1,0]],
      upGrade1:[[1,0,0],undefined,[1,1,0],undefined],
      upGrade2:[[1,0,0],[1,1,0],undefined,undefined],
      add12:[1,0,0],
      add13:[1,0,0],
      add24:[1,1,0],
      add34:[1,1,0],
      details:[
        "免费生产(太阳+1)，升级1(太阳-1)     升级后(太阳+2)，升级2(太阳-2)升级后(太阳+1 水+1)",
        "免费生产(太阳+2)，升级2(太阳-1 水-1)升级后(太阳+2 水+1)",
        "免费生产(太阳+1 水+1)，升级1(太阳-1 水-1)升级后(太阳+2 水+1)",
        "免费生产(太阳+2 水+1)已是最高等级"
      ]

    },
    {
      number:4,
      name: "浇水",
      status:0,
      point: [0,1,2,5],
      cost: [[0,0,0],[0,0,0,],[0,0,0],[0,0,0]],
      output: [[0,1,0],[0,1,0],[0,2,0],[0,0,0]],
      upGrade1:[[1,1,0],undefined,[0,2,2],undefined],
      upGrade2:[undefined,[0,1,1],undefined,undefined],
      add12:[1,1,0],
      add23:[0,1,1],
      add34:[0,2,2],
      details:[
        "免费生产(水+1)，升级1(太阳-1 水-1)升级后(水+1 分值1)",
        "免费生产(水+1 分值1)，升级2(水-1 化肥-1)升级后(水+2 分值2)",
        "免费生产(水+2 分值2)，升级1(水-2 化肥-2)升级后(无法生产，分值5)",
        "无法生产，分值5，已是最高等级"
      ]
    },
    {
      number:5,
      name: "浇水",
      status:0,
      point: [0,1,2,5],
      cost: [[0,0,0],[0,0,0,],[0,0,0],[0,0,0]],
      output: [[0,1,0],[0,1,0],[0,2,0],[0,0,0]],
      upGrade1:[[1,1,0],undefined,[0,2,2],undefined],
      upGrade2:[undefined,[0,1,1],undefined,undefined],
      add12:[1,1,0],
      add23:[0,1,1],
      add34:[0,2,2],
      details:[
        "免费生产(水+1)，升级1(太阳-1 水-1)升级后(水+1 分值1)",
        "免费生产(水+1 分值1)，升级2(水-1 化肥-1)升级后(水+2 分值2)",
        "免费生产(水+2 分值2)，升级1(水-2 化肥-2)升级后(无法生产，分值5)",
        "无法生产，分值5，已是最高等级"
      ]
    },
    {
      number:6,
      name: "浇水",
      status:0,
      point: [0,1,2,5],
      cost: [[0,0,0],[0,0,0,],[0,0,0],[0,0,0]],
      output: [[0,1,0],[0,1,0],[0,2,0],[0,0,0]],
      upGrade1:[[1,1,0],undefined,[0,2,2],undefined],
      upGrade2:[undefined,[0,1,1],undefined,undefined],
      add12:[1,1,0],
      add23:[0,1,1],
      add34:[0,2,2],
      details:[
        "免费生产(水+1)，升级1(太阳-1 水-1)升级后(水+1 分值1)",
        "免费生产(水+1 分值1)，升级2(水-1 化肥-1)升级后(水+2 分值2)",
        "免费生产(水+2 分值2)，升级1(水-2 化肥-2)升级后(无法生产，分值5)",
        "无法生产，分值5，已是最高等级"
      ]
    },
    {
      number:7,
      name: "施肥",
      status:0,
      point: [0,0,0,2],
      cost: [undefined,[0,0,0],[0,0,0],[0,0,0]],
      output: [[0,0,0],[0,0,1],[0,0,1],[0,0,2]],
      upGrade1:[[0,2,0],undefined,[2,1,0],undefined],
      upGrade2:[[2,0,0],[2,1,0],undefined,undefined],
      add12:[0,2,0],
      add13:[2.0,0],
      add24:[1,2,0],
      add34:[2,1,0],
      details:[
        "无法生产，升级1(水-2)升级后(化肥+1)，升级2(太阳-2)升级后(化肥+1)",
        "免费生产(化肥+1)，升级2(水-2 太阳-1)升级后(化肥+2 分值2)",
        "免费生产(化肥+1)，升级1(水-1 太阳-2)升级后(化肥+2 分值2)",
        "化肥+2 分值2，已是最高等级"
      ]

    },
    {
      number:8,
      name: "施肥",
      status:0,
      point: [0,0,0,2],
      cost: [undefined,[0,0,0],[0,0,0],[0,0,0]],
      output: [[0,0,0],[0,0,1],[0,0,1],[0,0,2]],
      upGrade1:[[0,2,0],undefined,[2,1,0],undefined],
      upGrade2:[[2,0,0],[2,1,0],undefined,undefined],
      add12:[0,2,0],
      add13:[2.0,0],
      add24:[1,2,0],
      add34:[2,1,0],
      details:[
        "无法生产，升级1(水-2)升级后(化肥+1)，升级2(太阳-2)升级后(化肥+1)",
        "免费生产(化肥+1)，升级2(水-2 太阳-1)升级后(化肥+2 分值2)",
        "免费生产(化肥+1)，升级1(水-1 太阳-2)升级后(化肥+2 分值2)",
        "化肥+2 分值2，已是最高等级"
      ]

    },
    {
      number:9,
      name: "施肥",
      status:0,
      point: [0,0,0,2],
      cost: [undefined,[0,0,0],[0,0,0],[0,0,0]],
      output: [[0,0,0],[0,0,1],[0,0,1],[0,0,2]],
      upGrade1:[[0,2,0],undefined,[2,1,0],undefined],
      upGrade2:[[2,0,0],[2,1,0],undefined,undefined],
      add12:[0,2,0],
      add13:[2.0,0],
      add24:[1,2,0],
      add34:[2,1,0],
      details:[
        "无法生产，升级1(水-2)升级后(化肥+1)，升级2(太阳-2)升级后(化肥+1)",
        "免费生产(化肥+1)，升级2(水-2 太阳-1)升级后(化肥+2 分值2)",
        "免费生产(化肥+1)，升级1(水-1 太阳-2)升级后(化肥+2 分值2)",
        "化肥+2 分值2，已是最高等级"
      ]

    },
    {
      number:10,
      name: "小卖部",
      status:0,
      point: [0,0,0,0],
      cost: [[1,1,0],[0,1,0],[1,0,0],[1,1,1]],
      output: [[0,0,1],[0,1,1],[0,1,1],[1,1,1]],
      tradeSun:[1,undefined,1,1],
      tradeWater:[1,1,undefined,1],
      tradeFertilizer:[undefined,undefined,undefined,1],
      upGrade1:[[0,2,0],undefined,[1,1,0],undefined],
      upGrade2:[[2,0,0],[0,1,1],undefined,undefined],
      add12:[0,2,0],
      add13:[2,0,0],
      add24:[0,1,1],
      add34:[1,0,1],
      details:[
        "太阳-1/水-1=>化肥+1，升级1(水-2)升级后(水-1=>太阳+1化肥+1)，升级2(太阳-2)升级后(太阳-1=>水+1化肥+1)",
        "水-1=>太阳+1化肥+1，升级2(水-1 化肥-1)升级后(太阳-1/水-1/化肥-1=>太阳+1水+1化肥+1)",
        "太阳-1=>水+1化肥+1，升级1(太阳-1 化肥-1)升级后(太阳-1/水-1/化肥-1=>太阳+1水+1化肥+1)",
        "太阳-1/水-1/化肥-1=>太阳+1水+1化肥+1，已是最高等级"
      ]
    },
    {
      number:11,
      name: "超市",
      status:0,
      point: [0,0,0,0],
      cost: [[2,2,0],[0,2,2],[0,0,2],[2,2,0]],
      output: [[1,1,0],[0,3,0],[3,0,0],[0,0,3]],
      tradeSun:[2,2,undefined,2],
      tradeWater:[2,undefined,2,2],
      tradeFertilizer:[undefined,2,2,undefined],
      upGrade1:[[1,0,0],undefined,[1,1,0],[0,0,1]],
      upGrade2:[[0,1,0],[1,1,0],undefined,[0,0,1]],
      add12:[1,0,0],
      add13:[0,1,0],
      add24:[1,1,0],
      add34:[1,1,0],
      add43:[0,0,1],
      add42:[0,0,1],
      details:[
        "太阳-2/水-2=>太阳+1水+1，升级1(太阳-1)升级后(太阳-2/化肥-2=>水+3)，升级2(水-1)升级后(水-2/化肥-2=>太阳+3)",
        "太阳-2/化肥-2=>水+3，升级2(水-1 太阳-1)升级后(水-2/太阳-2=>化肥+3)",
        "水-2/化肥-2=>太阳+3，升级1(太阳-1 水-1)升级后(水-2/太阳-2=>化肥+3)",
        "水-2/太阳-2=>化肥+3，升级1(化肥-1)升级后(水-2/化肥-2=>太阳+3)，升级2(化肥-1)升级后(太阳-2/化肥-2=>水+3)"
      ]
    },
    {
      number:12,
      name: "工具",
      status:0,
      point: [0,0,0,4],
      cost: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      output: [[0,0,0],[1,1,0],[1,1,1],[0,0,0]],
      upGrade1:[[1,1,2],[1,1,1],undefined,undefined],
      upGrade2:[[1,1,0],undefined,[2,2,2],undefined],
      add12:[1,1,0],
      add23:[1,1,1],
      add34:[2,2,2],
      add14:[1,1,2],
      details:[
        "无法生产，升级1(太阳-1 水-1 化肥-2)升级后(无法生产，分值4),升级2(太阳-1 水-1)升级后(太阳+1水+1)",
        "免费生产(太阳+1水+1)，升级1(太阳-1水-1化肥-1)升级后(太阳+1水+1化肥+1)",
        "免费生产(太阳+1水+1化肥+1)，升级2(太阳-2水-2化肥-2)升级后(无法生产，分值4)",
        "无法生产，分值4，已是最高等级"
      ]
    },
    {
      number:13,
      name: "萝卜",
      status:0,
      point: [0,1,3,6],
      cost: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      output: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      upGrade1:[[1,1,0],undefined,[2,2,2],undefined],
      upGrade2:[undefined,[1,1,1],undefined,undefined],
      add12:[1,1,0],
      add23:[1,1,1],
      add34:[2,2,2],
      details:[
        "无法生产，升级1(太阳-1 水-1)升级后(无法生产，分值1)",
        "无法生产，分值1，升级2(太阳-1水-1化肥-1)升级后(无法生产，分值3)",
        "无法生产，分值3，升级1(太阳-2水-2化肥-2)升级后(无法生产，分值6)",
        "无法生产，分值6，已是最高等级"
      ]
    },
    {
      number:14,
      name: "萝卜",
      status:0,
      point: [0,1,3,6],
      cost: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      output: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      upGrade1:[[1,1,0],undefined,[2,2,2],undefined],
      upGrade2:[undefined,[1,1,1],undefined,undefined],
      add12:[1,1,0],
      add23:[1,1,1],
      add34:[2,2,2],
      details:[
        "无法生产，升级1(太阳-1 水-1)升级后(无法生产，分值1)",
        "无法生产，分值1，升级2(太阳-1水-1化肥-1)升级后(无法生产，分值3)",
        "无法生产，分值3，升级1(太阳-2水-2化肥-2)升级后(无法生产，分值6)",
        "无法生产，分值6，已是最高等级"
      ]
    },
    {
      number:15,
      name: "土豆",
      status:0,
      point: [0,3,6,10],
      cost: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      output: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      upGrade1:[[1,1,2],undefined,[3,3,4],undefined],
      upGrade2:[undefined,[2,2,3],undefined,undefined],
      add12:[1,1,2],
      add23:[2,2,3],
      add34:[3,3,4],
      details:[
        "无法生产 升级1(太阳-1水-1化肥-2)升级后(无法生产，分值3)",
        "无法生产 分值3，升级2(太阳-2水-2化肥-3)升级后(无法生产，分值6)",
        "无法生产 分值6，升级1(太阳-3水-3化肥-4)升级后(无法生产，分值10)",
        "无法生产 分值10，已是最高等级"
      ]
    },
    {
      number:16,
      name: "土豆",
      status:0,
      point: [0,3,6,10],
      cost: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      output: [[0,0,0],[0,0,0],[0,0,0],[0,0,0]],
      upGrade1:[[1,1,2],undefined,[3,3,4],undefined],
      upGrade2:[undefined,[2,2,3],undefined,undefined],
      add12:[1,1,2],
      add23:[2,2,3],
      add34:[3,3,4],
      details:[
        "无法生产 升级1(太阳-1水-1化肥-2)升级后(无法生产，分值3)",
        "无法生产 分值3，升级2(太阳-2水-2化肥-3)升级后(无法生产，分值6)",
        "无法生产 分值6，升级1(太阳-3水-3化肥-4)升级后(无法生产，分值10)",
        "无法生产 分值10，已是最高等级"
      ]
    }

  ]
};

